Creating dataframe from lists

In [3]:
import pandas as pd
import random

In [19]:
# Dictionary of lists
name = ["name" + str(x) for x in range(10)]
age = [float(random.random()*x) for x in range(100,110)]
roll_no = [x for x in range(1000,1010)]
diction = {"name": name, "age" : age, "roll_no":roll_no}
df = pd.DataFrame(diction)
df.head()

    name        age  roll_no
0  name0  65.893307     1000
1  name1  75.565045     1001
2  name2  72.590084     1002
3  name3   6.779215     1003
4  name4  42.845528     1004

In [23]:
# using zip function
nums = ["one", "ten", "hundred", "thousand"]
values = [1,10,100,1000]
df = pd.DataFrame(list(zip(nums, values)), columns=["Names", "Values"])
print(df)

      Names  Values
0       one       1
1       ten      10
2   hundred     100
3  thousand    1000

In [24]:
# Multi-dimensional list
data = [["Name", "Rishabh"], ["Class", "10th"], ["RollNumber", 26], ["Section", 'C']]
df = pd.DataFrame(data, columns=["label", "data"])
df.head()

        label     data
0        Name  Rishabh
1       Class     10th
2  RollNumber       26
3     Section        C

In [27]:
# Changing datatype after creating Dataframe
randomDigits = [random.random()*x for x in range(100,110)]
df = pd.DataFrame(randomDigits, columns=["Random_Digits"])
df.head()
df["Random_Digits"] = df["Random_Digits"].astype(int)
df.head()

   Random_Digits
0             67
1             18
2             64
3             15
4             30

In [28]:
# Using index and column names
data = ["Aparna", "Pankaj", "Sudhir", "Garvit"]
df = pd.DataFrame(data, index=range(1000,1004), columns=["Names"])
df.head()

       Names
1000  Aparna
1001  Pankaj
1002  Sudhir
1003  Garvit